# Смоделируем выборку объёма 1000 из нормального распределения с параметрами: mu = 170; sigma = 10
n=1000
mu=170
sigma=10 
sample=rnorm(n,mu,sigma)
#Сформируем выборку из ген. совокупности:
half=sample[900:1000]
head(half)
# Построим гистограмму:
hist(sample, col = "purple",main="Гистограмма нормального распределения с.в. и ее график плотности")
curve(dnorm(x, mu, sigma)*n, mu-3*sigma, mu+3*sigma, lw="3", col="black", add=TRUE)
#Найдем выборочное среднее
sred=mean(half)
#Найдем выборочную дисперсию
disp=var(half)
#Найдем выборочное среднеквадратичное отклонение
s=sqrt(disp)

# Смоделируем выборку объёма 1000 из экспоненциального распределения с параметром alpha=1
n=1000
alpha=1
sample=rexp(n,alpha)
# Построим гистограмму:
hist(sample, col = "red", main="Гистограмма экспоненциального 
     распределения с.в. и ее график плотности")
# Построим график плотности экспоненциального распределения и совместим его с гистограммой:
curve(dexp(x,alpha)*n, 0,5, lw="3", col="black", add=TRUE)
#Получим выборочную оценку параметра распределения alpha
1/mean(part)

#Смоделируем выборку объема 1000 из распределения Стьюдента с параметром k=5:
n=1000
k=5
sample=rt(n,k)
#Построим гистограмму
hist(sample,col="blue", main="Гистограмма распределения Стьюдента с.в. и ее график плотности")
#Построим график плотности распределения Стьюдента и совместим его с гистограммой:
curve(dt(x,k)*n,-6,6,lw="3",col="black",add=TRUE)
#Сформируем выборку из ген. совокупности:
part=sample[900:1000]
#Получение выборочной оценки для k
s=sd(part)
(2*s*s)/(s*s-1)

#Получим выборку из равномерного распределения
#объем выборки
n=1000
#Зададим интервал (-4;6)
#параметры
a=1
b=9
#выборка
sample=runif(n,a,b)
#Построим гистограмму
hist(sample, main="Гистограмма равномерного распределения с.в. и ее график плотности", col="yellow")
# Построим график плотности равномерного распределения (с выбранными параметрами) и совместим его с гистограммой:
curve(dunif(x,a,b)*n,-1,10,lw="3", col="black", add=TRUE)
#Сформируем выборку из ген. совокупности:
part=sample[900:1000]
#Вычисление оценок
mean(part)+sqrt(3)*sd(part)
mean(part)-sqrt(3)*sd(part)
