n  = 500 
mu = 105 
sigma = 10  
iq=rnorm(n,mu,sigma)
head(iq)

eps = 0.1 #90% доверительный интервал
n = length(iq) #объем выборки
X = mean(iq) #выборочное среднее
X
S = sd(iq) #выборочное среднеквадратическое отклонение
S
t = qt(1-0.5*eps, n-1) #квантиль порядка 1-0.5*eps распределения Стьюдента с (n-1) степенью свободы
t
rad = t*S/sqrt(n) #радиус интервала
rad
myLeft = X - rad #левая граница довер. интервала
myLeft
myRight = X + rad #правая граница
myRight

eps = 0.05 #95% доверительный интервал
t = qt(1-0.5*eps, n-1) #квантиль порядка 1-0.5*eps распределения Стьюдента с (n-1) степенью свободы
t
rad = t*S/sqrt(n) #радиус интервала
rad
myLeft = X - rad #левая граница довер. интервала
myLeft
myRight = X + rad #правая граница
myRight

eps = 0.01 #99% доверительный интервал
t = qt(1-0.5*eps, n-1) #квантиль порядка 1-0.5*eps распределения Стьюдента с (n-1) степенью свободы
t
rad = t*S/sqrt(n) #радиус интервала
rad
myLeft = X - rad #левая граница довер. интервала
myLeft
myRight = X + rad #правая граница
myRight


n  = 100 
mu = 105 
sigma = 10  
iq=rnorm(n,mu,sigma)
head(iq)
eps = 0.05 #95% доверительный интервал
n = length(iq) #объем выборки
X = mean(iq) #выборочное среднее
X
S = sd(iq) #выборочное среднеквадратическое отклонение
S
t = qt(1-0.5*eps, n-1) #квантиль порядка 1-0.5*eps распределения Стьюдента с (n-1) степенью свободы
t
rad = t*S/sqrt(n) #радиус интервала
rad
myLeft = X - rad #левая граница довер. интервала
myLeft
myRight = X + rad #правая граница
myRight

n  = 500 
mu = 105 
sigma = 10  
iq=rnorm(n,mu,sigma)
head(iq)
eps = 0.05 #95% доверительный интервал
n = length(iq) #объем выборки
X = mean(iq) #выборочное среднее
X
S = sd(iq) #выборочное среднеквадратическое отклонение
S
t = qt(1-0.5*eps, n-1) #квантиль порядка 1-0.5*eps распределения Стьюдента с (n-1) степенью свободы
t
rad = t*S/sqrt(n) #радиус интервала
rad
myLeft = X - rad #левая граница довер. интервала
myLeft
myRight = X + rad #правая граница
myRight

n  = 1000 
mu = 105 
sigma = 10  
iq=rnorm(n,mu,sigma)
head(iq)
eps = 0.05 #95% доверительный интервал
n = length(iq) #объем выборки
X = mean(iq) #выборочное среднее
X
S = sd(iq) #выборочное среднеквадратическое отклонение
S
t = qt(1-0.5*eps, n-1) #квантиль порядка 1-0.5*eps распределения Стьюдента с (n-1) степенью свободы
t
rad = t*S/sqrt(n) #радиус интервала
rad
myLeft = X - rad #левая граница довер. интервала
myLeft
myRight = X + rad #правая граница
myRight

n  = 10000 
mu = 105 
sigma = 10  
iq=rnorm(n,mu,sigma)
head(iq)
eps = 0.05 #95% доверительный интервал
n = length(iq) #объем выборки
X = mean(iq) #выборочное среднее
X
S = sd(iq) #выборочное среднеквадратическое отклонение
S
t = qt(1-0.5*eps, n-1) #квантиль порядка 1-0.5*eps распределения Стьюдента с (n-1) степенью свободы
t
rad = t*S/sqrt(n) #радиус интервала
rad
myLeft = X - rad #левая граница довер. интервала
myLeft
myRight = X + rad #правая граница
myRight
